In [1]:
import pandas as pd
import numpy as np

In [2]:
people = {
    'first': ['Corey', 'Jane', 'John', 'Chris', np.nan, None, 'NA'], 
    'last': ['Schafer', 'Doe', 'Doe', 'Schafer', np.nan, np.nan, 'Missing'], 
    'email': ['CoreyMSchafer@gmail.com', 'JaneDoe@email.com', 'JohnDoe@email.com', None, np.nan, 'Anonymous@email.com', 'NA'],
    'age': ['33', '55', '63', '36', None, None, 'Missing']
}

In [3]:
df = pd.DataFrame(people)

In [4]:
df

   first     last                    email      age
0  Corey  Schafer  CoreyMSchafer@gmail.com       33
1   Jane      Doe        JaneDoe@email.com       55
2   John      Doe        JohnDoe@email.com       63
3  Chris  Schafer                     None       36
4    NaN      NaN                      NaN     None
5   None      NaN      Anonymous@email.com     None
6     NA  Missing                       NA  Missing

# replacing custom missing value with numpy NaN value

In [5]:
df.replace('NA', np.nan, inplace=True)     # NA vanni custom missing value lai numpy ko nan value le replace gareko & inplace=True ko kaam vaneko overwriting changes to permanent
df.replace('Missing', np.nan, inplace=True)    # Missing vanni custom missing value lai numpy ko nan value le replace gareko & inplace=True ko kaam vaneko overwriting changes to permanent

In [6]:
df         # custom missing value lai numpy ko nan value le replace garyo ki nai vanera check gareko

   first     last                    email   age
0  Corey  Schafer  CoreyMSchafer@gmail.com    33
1   Jane      Doe        JaneDoe@email.com    55
2   John      Doe        JohnDoe@email.com    63
3  Chris  Schafer                     None    36
4    NaN      NaN                      NaN  None
5   None      NaN      Anonymous@email.com  None
6    NaN      NaN                      NaN   NaN

# dropna() method
#  ==> by default yedi NaN value vetyo vani index or row drop garcha
#  ==> dropna() method accepts argument inplace=True for overwriting changes

In [7]:
# df.dropna()        # dropna() method le NaN or None value vako row lai drop garcha

# df.dropna(axis='index', how='any')       # by default ma yo kaam vai rako huncha (mathi ko dropna() statement & yo statement le exact same kaam garcha) # axis=index vannale row or record lai drop garni vaneko & how='any' vannale yedi row ma kunai auta column ko value NaN or None vaye pani row falni vaneko... yedi row ko sabbai column ko value NaN or None vaye matra row falni vanna paryo vani any='all' garincha

In [8]:
# yestari column nai drop chai real life ma khasai garidaina.. hami mostly row lai nai drop garchau
# df.dropna(axis='columns')  # yedi NaN value or None vetyo vani column wise drop garcha
# df.dropna(axis='columns', how='all')

# subset property of driopna() method

In [9]:
df.dropna(axis='index', how='all', subset=['last', 'email'])      # kunai record or row lai falna lai tyo subset list vitra vako all or any columns ko value NaN or None huna parcha.. aru column ko NaN or None vayera row nafalne but yedi all or any last name & email ko NaN or None vayo vani chai record falni vaneko

   first     last                    email   age
0  Corey  Schafer  CoreyMSchafer@gmail.com    33
1   Jane      Doe        JaneDoe@email.com    55
2   John      Doe        JohnDoe@email.com    63
3  Chris  Schafer                     None    36
5   None      NaN      Anonymous@email.com  None

In [10]:
# for overwriting the changes
#df.dropna(axis='index', how='all', subset=['last', 'email'], inplace=True)

In [11]:
df

   first     last                    email   age
0  Corey  Schafer  CoreyMSchafer@gmail.com    33
1   Jane      Doe        JaneDoe@email.com    55
2   John      Doe        JohnDoe@email.com    63
3  Chris  Schafer                     None    36
4    NaN      NaN                      NaN  None
5   None      NaN      Anonymous@email.com  None
6    NaN      NaN                      NaN   NaN

#  isna() method for checking NaN value

In [12]:
df.isna()

   first   last  email    age
0  False  False  False  False
1  False  False  False  False
2  False  False  False  False
3  False  False   True  False
4   True   True   True   True
5   True   True  False   True
6   True   True   True   True

# fillna()
#  ==> it is used to fill NaN values with another fillable values

In [13]:
df.fillna(0)          # yaha NaN values jati sabbai lai 0 le replace garni vaneko

   first     last                    email age
0  Corey  Schafer  CoreyMSchafer@gmail.com  33
1   Jane      Doe        JaneDoe@email.com  55
2   John      Doe        JohnDoe@email.com  63
3  Chris  Schafer                        0  36
4      0        0                        0   0
5      0        0      Anonymous@email.com   0
6      0        0                        0   0

In [14]:
df.dtypes         # checking datatypes of dataframe     # generally object type vanni bittikai ki chai tyo column ko type string cha  ki chai mix type (string & int) cha vanni bujne

first    object
last     object
email    object
age      object
dtype: object

In [15]:
# yedi kunai column integer data type ko ho ki nai vanera check garna ko lagi, tes column ma numerical method le operate garni .. yedi operate garda error aayena vani tyo column integer data type kai ho vanni bujincha else integer type o haina vanni bujincha
# df['age'].mean()

#  checking data type of NaN values of the dataframe

In [16]:
type(np.nan)           # so dataframe ko NaN values haru float type ko huncha...

float

# Converting data type of column to another data type

In [17]:
df

   first     last                    email   age
0  Corey  Schafer  CoreyMSchafer@gmail.com    33
1   Jane      Doe        JaneDoe@email.com    55
2   John      Doe        JohnDoe@email.com    63
3  Chris  Schafer                     None    36
4    NaN      NaN                      NaN  None
5   None      NaN      Anonymous@email.com  None
6    NaN      NaN                      NaN   NaN

In [18]:
# yedi column ma NaN values cha vani tmle tyo column lai directly integer ma convert garna sakdaina.. u can only directly convert it to float type
df['age'] = df['age'].astype(float)             # yo column lai directly float type ma convert garna sakincha


# df['age'] = df['age'].astype(int)              # ERROR occurs : age vanni column ma NaN value cha so yo column lai directly int type ma convert garna sakdainau

In [19]:
df.dtypes

first     object
last      object
email     object
age      float64
dtype: object

In [20]:
# yedi kunai halat ma NaN values vako column (eg: age) lai int type mai laijana cha vani

# 1st you need to fill all NaN values with 0
# df.fillna(0)                               # Not overwriting the changes
df.fillna(0, inplace=True)                 # changes lai overwrite gareko permanently

# 2nd : now u can change age column type to int type
df['age'] = df['age'].astype(int)
# OR
# df['age'] = df['age'].astype(np.int64)

In [21]:
df

   first     last                    email  age
0  Corey  Schafer  CoreyMSchafer@gmail.com   33
1   Jane      Doe        JaneDoe@email.com   55
2   John      Doe        JohnDoe@email.com   63
3  Chris  Schafer                        0   36
4      0        0                        0    0
5      0        0      Anonymous@email.com    0
6      0        0                        0    0

In [22]:
df['age'].mean()
# df['age'].median()

26.714285714285715